using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Project_Arrange : MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {
        //**2024.04.26**
        /*
        - 중력 추가 값 확인 및 수정
        - 무한 점프 제한
        - 떨어짐 애니메이션 재생 안됨 수정
        - 카메라 팔로우 기능

           진행예정 : 시소 중력값 / 블럭 내려갈 때 뚫림. / 맞는 블록만 올라가기
        */

        //**2024.05.10**
        /* 시소 무게중심
         * 정답맞는 블록만 올라가기
         * 블록 텍스트 입력
         * 플레이어 상자 밀기 애니메이션 적용

         진행예정 : 상자 위로 올라갔을 때 미리 애니메이션 나옴 수정.
        /(시간 남을 시  : 특정 입력을 받으면 움직이는 상자) 
        */

        //**2024.05.16**
        /* 타일 움직임
         * 플레이어 상자 밀기 상자 위 애니메이션 수정.
         * 주인공 달리기 좌우반전 오류 발생 수정.
         
           진행예정 : 특정 입력을 받으면 움직이는 상자.        
         */

        //**2024.05.16**
        /* 타일 움직임
         * 플레이어 상자 밀기 상자 위 애니메이션 수정.
         * 주인공 달리기 좌우반전 오류 발생 수정.
         
           진행예정 : 특정 입력을 받으면 움직이는 상자.        
         */

        //**2024.05.31**
        /* 상하 타일 낙하 애니메이션 오류 수정완료(+추가 디테일 작업 필요함)
         + 요 부분에서 시간이 조금 걸렸습니당...
         
           진행예정 :  NPC 상호작용,대화창 생성기능, 대화 텍스트 입력
           ,대화 시 일러스트 색상 변경, 씬 이동    
         */

        //**2024.06.14**
        /* 대화창 생성기능
         * 한글 폰트 유니티 내 적용
         * NPC 버튼 상호작용 대화창 생성 기능
         
           진행예정 : NPC 영역 내에서 버튼다운 시 대화창 , 
           대화 텍스트 한 글자씩 나타내기,
           대화 시 일러스트 색상변경
         */

    }

    // Update is called once per frame
    void Update()
{

}
}
