using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Project_Arrange : MonoBehaviour
{
    // Start is called before the first frame update
    void Start()
    {
        //**2024.04.26**
        /*
        - 중력 추가 값 확인 및 수정
        - 무한 점프 제한
        - 떨어짐 애니메이션 재생 안됨 수정
        - 카메라 팔로우 기능

           진행예정 : 시소 중력값 / 블럭 내려갈 때 뚫림. / 맞는 블록만 올라가기
        */

        //**2024.05.10**
        /* 시소 무게중심
         * 정답맞는 블록만 올라가기
         * 블록 텍스트 입력
         * 플레이어 상자 밀기 애니메이션 적용

         진행예정 : 상자 위로 올라갔을 때 미리 애니메이션 나옴 수정.
        /(시간 남을 시  : 특정 입력을 받으면 움직이는 상자) 
        */

        //**2024.05.16**
        /* 타일 움직임
         * 플레이어 상자 밀기 상자 위 밀기 애니메이션 재생 수정.
         * 주인공 달리기 좌우반전 오류 발생 수정.
         
           진행예정 :        
         */


        //**2024.06.07**
        /* 24.05.21 이후부터 상하이동 타일 떨어지는 애니메이션 재생 수정중.
         * 스프라이트 유니티 재생 확인
             
           진행예정 : 키입력 시 npc 상호작용
           (시간 남을 시  : 특정 입력(버튼)을 받으면 움직이는 상자. ) 
        */

        //**2024.07.28**
        /* 인벤토리 UI 생성
         * 인벤토리 스크립트 작성
         */


        //**2024.08.01**
        /* 인벤토리 UI 재생성
         * 인벤토리 스크립트 수정
         */
    }

    // Update is called once per frame
    void Update()
{

}
}
